""" Абстрактный класс - это класс, который содержит один или несколько абстрактных методов, которые не имеют 
реализации в самом классе. Он предназначен для использования в качестве базового класса для других классов, 
которые будут наследовать его. От абстрактного класса нельзя создать объекты напрямую, он служит лишь для 
определения общего интерфейса для всех своих подклассов. Подклассы абстрактного класса должны реализовать все 
его абстрактные методы, чтобы стать полноценными классами."""

""" Множественное наследование - это концепция в объектно-ориентированном программировании, которая позволяет 
классу наследовать свойства и методы от нескольких родительских классов одновременно. Это означает, что класс 
может наследовать и использовать функциональность не только от одного класса-родителя, но и от нескольких классов 
одновременно. Например, класс может наследовать методы от класса "Животное" и класса "Рыба", чтобы иметь свойства 
и поведение как животное, так и рыбы. Это позволяет создавать более гибкие и переиспользуемые структуры кода. """
